In [1]:
import numpy as np
import pandas as pd

In [4]:
df = pd.read_csv("employe.csv")
df

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,Bangalore,3,34,Male,No,0,0
1,Bachelors,2013,Pune,1,28,Female,No,3,1
2,Bachelors,2014,New Delhi,3,38,Female,No,2,0
3,Masters,2016,Bangalore,3,27,Male,No,5,1
4,Masters,2017,Pune,3,24,Male,Yes,2,1
...,...,...,...,...,...,...,...,...,...
4648,Bachelors,2013,Bangalore,3,26,Female,No,4,0
4649,Masters,2013,Pune,2,37,Male,No,2,1
4650,Masters,2018,New Delhi,3,27,Male,No,5,1
4651,Bachelors,2012,Bangalore,3,30,Male,Yes,2,0
4652,Bachelors,2015,Bangalore,3,33,Male,Yes,4,0

In [6]:
df.head(5)

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,Bangalore,3,34,Male,No,0,0
1,Bachelors,2013,Pune,1,28,Female,No,3,1
2,Bachelors,2014,New Delhi,3,38,Female,No,2,0
3,Masters,2016,Bangalore,3,27,Male,No,5,1
4,Masters,2017,Pune,3,24,Male,Yes,2,1

In [10]:
df.dtypes

Education                    object
JoiningYear                   int64
City                         object
PaymentTier                   int64
Age                           int64
Gender                       object
EverBenched                  object
ExperienceInCurrentDomain     int64
LeaveOrNot                    int64
dtype: object

In [11]:
df.shape

(4653, 9)

In [15]:
df["City"].unique()

array(['Bangalore', 'Pune', 'New Delhi'], dtype=object)

In [29]:
# df[df["City"]=="Bangalore"].count()
df.groupby("City").count()

,Education,JoiningYear,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
City,,,,,,,,
Bangalore,2228,2228,2228,2228,2228,2228,2228,2228
New Delhi,1157,1157,1157,1157,1157,1157,1157,1157
Pune,1268,1268,1268,1268,1268,1268,1268,1268

In [23]:
df[df["Education"]=="Masters"]

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
3,Masters,2016,Bangalore,3,27,Male,No,5,1
4,Masters,2017,Pune,3,24,Male,Yes,2,1
9,Masters,2017,New Delhi,2,37,Male,No,2,0
10,Masters,2012,Bangalore,3,27,Male,No,5,1
21,Masters,2017,New Delhi,2,28,Male,No,4,0
...,...,...,...,...,...,...,...,...,...
4618,Masters,2017,New Delhi,3,38,Female,No,2,1
4636,Masters,2014,New Delhi,3,37,Female,No,0,1
4645,Masters,2017,Pune,2,31,Female,No,2,0
4649,Masters,2013,Pune,2,37,Male,No,2,1
4650,Masters,2018,New Delhi,3,27,Male,No,5,1

In [30]:
df.groupby("Gender").count()

,Education,JoiningYear,City,PaymentTier,Age,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
Gender,,,,,,,,
Female,1875,1875,1875,1875,1875,1875,1875,1875
Male,2778,2778,2778,2778,2778,2778,2778,2778

In [31]:
df[df["ExperienceInCurrentDomain"]>3]

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
3,Masters,2016,Bangalore,3,27,Male,No,5,1
10,Masters,2012,Bangalore,3,27,Male,No,5,1
12,Bachelors,2018,Pune,3,32,Male,Yes,5,1
14,Bachelors,2012,Bangalore,3,37,Male,No,4,0
17,Bachelors,2014,Pune,3,34,Male,No,4,0
...,...,...,...,...,...,...,...,...,...
4642,Bachelors,2012,Bangalore,3,36,Female,No,4,0
4643,Bachelors,2013,Bangalore,3,31,Female,No,5,0
4648,Bachelors,2013,Bangalore,3,26,Female,No,4,0
4650,Masters,2018,New Delhi,3,27,Male,No,5,1
4652,Bachelors,2015,Bangalore,3,33,Male,Yes,4,0

In [32]:
df[df["EverBenched"]=="No"]

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,Bangalore,3,34,Male,No,0,0
1,Bachelors,2013,Pune,1,28,Female,No,3,1
2,Bachelors,2014,New Delhi,3,38,Female,No,2,0
3,Masters,2016,Bangalore,3,27,Male,No,5,1
5,Bachelors,2016,Bangalore,3,22,Male,No,0,0
...,...,...,...,...,...,...,...,...,...
4646,Bachelors,2013,Bangalore,3,25,Female,No,3,0
4647,Bachelors,2016,Pune,3,30,Male,No,2,0
4648,Bachelors,2013,Bangalore,3,26,Female,No,4,0
4649,Masters,2013,Pune,2,37,Male,No,2,1
4650,Masters,2018,New Delhi,3,27,Male,No,5,1

In [34]:
df[df["JoiningYear"]>2015]

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,Bangalore,3,34,Male,No,0,0
3,Masters,2016,Bangalore,3,27,Male,No,5,1
4,Masters,2017,Pune,3,24,Male,Yes,2,1
5,Bachelors,2016,Bangalore,3,22,Male,No,0,0
7,Bachelors,2016,Bangalore,3,34,Female,No,2,1
...,...,...,...,...,...,...,...,...,...
4639,Bachelors,2017,Bangalore,3,28,Male,No,0,1
4641,Bachelors,2016,Bangalore,1,33,Female,No,0,1
4645,Masters,2017,Pune,2,31,Female,No,2,0
4647,Bachelors,2016,Pune,3,30,Male,No,2,0
4650,Masters,2018,New Delhi,3,27,Male,No,5,1

In [42]:
df.groupby("City")["Age"].mean()

City
Bangalore    29.594255
New Delhi    29.121003
Pune         29.288644
Name: Age, dtype: float64

In [47]:
df.groupby("Gender")["ExperienceInCurrentDomain"].mean()

Gender
Female    2.889067
Male      2.916847
Name: ExperienceInCurrentDomain, dtype: float64

In [53]:
df.groupby("PaymentTier")["PaymentTier"].count()

PaymentTier
1     243
2     918
3    3492
Name: PaymentTier, dtype: int64

In [59]:
df["JoiningYear"].min()
df["JoiningYear"].max()

np.int64(2018)

In [60]:
df.groupby("EverBenched")["ExperienceInCurrentDomain"].mean()

EverBenched
No     2.904910
Yes    2.912134
Name: ExperienceInCurrentDomain, dtype: float64

In [75]:
counts = df.groupby("City").count()
counts

,Education,JoiningYear,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
City,,,,,,,,
Bangalore,2228,2228,2228,2228,2228,2228,2228,2228
New Delhi,1157,1157,1157,1157,1157,1157,1157,1157
Pune,1268,1268,1268,1268,1268,1268,1268,1268

In [80]:
# Find the city with the highest number of employees
city_counts = df["City"].value_counts()
high = city_counts.idxmax()
high

'Bangalore'

In [84]:
df.groupby("LeaveOrNot")["Age"].mean()

LeaveOrNot
0    29.571896
1    29.052500
Name: Age, dtype: float64

In [ ]:
left_emp =(df["LeaveOrNot"]==1).sum()
total_emp = len(df)
'''(df["LeaveOrNot"] == 1) → Boolean Series (True if left, False otherwise)
.sum() → Counts the True values → total employees who left
Divide by total employees and multiply by 100 → percentage'''

In [107]:
left =(left_emp/total_emp)*100
left

np.float64(34.38641736514077)

In [114]:
left =  df[df['LeaveOrNot'] == 1]
left_edu = left.groupby("Education")["Education"].count()
left_edu

Education
Bachelors    1129
Masters       426
PHD            45
Name: Education, dtype: int64